ConfigFiles/Catalogs/ШагиСценариевПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШагиСценариевПользователя</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СнипетШага</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/CommonModules/РедакторСценариевВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает макет с двоичными данными ключевых слов Gherkin
//
// Возвращаемое значение:
//  ДвоичныеДанные
Функция ПолучитьКлючевыеСловаGherkin() Экспорт
	Возврат ПолучитьОбщийМакет("КлючевыеСловаGherkin");
Конецфункции

// Возвращает данные шагов редактора из справочника ШагиСценариевПользователя
//
// Параметры:
//   Язык - Строка
//
// Возвращаемое значение:
//   Массив
//
Функция ДанныеШагов(Язык) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШагиСценариевПользователя.Наименование КАК Наименование,
		|	ШагиСценариевПользователя.СнипетШага КАК СнипетШага,
		|	ШагиСценариевПользователя.Описание КАК Описание,
		|	ШагиСценариевПользователя.Представление КАК Представление
		|ИЗ
		|	Справочник.ШагиСценариевПользователя КАК ШагиСценариевПользователя
		|ГДЕ
		|	НЕ ШагиСценариевПользователя.ПометкаУдаления
		|	И НЕ ШагиСценариевПользователя.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеШага = Новый Структура;
		ДанныеШага.Вставить("insertText", ВыборкаДетальныеЗаписи.Наименование);
		Поз = Найти(ВыборкаДетальныеЗаписи.Наименование, " ");
		Если Поз > 0 Тогда
			ДанныеШага.Вставить("filterText", СокрЛ(Сред(ВыборкаДетальныеЗаписи.Наименование, Поз)));
		Иначе	
			ДанныеШага.Вставить("filterText", ВыборкаДетальныеЗаписи.Наименование);
		КонецЕсли;	
		ДанныеШага.Вставить("sortText", ДанныеШага.insertText);
		ДанныеШага.Вставить("documentation", ВыборкаДетальныеЗаписи.Описание);
		ДанныеШага.Вставить("kind", 4);
		ДанныеШага.Вставить("section", "Секция");
		
		Результат.Добавить(ДанныеШага);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

// Возвращает массив имен подсценариев
// Параметры:
//  Массив - Массив сценариев пользователя
//
// Возвращаемое значение:
//  Массив
Функция ИменаПодсценариев(Массив) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СценарииРаботыПользователей.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СценарииРаботыПользователей КАК СценарииРаботыПользователей
		|ГДЕ
		|	СценарииРаботыПользователей.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Массив);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
КонецФункции

#КонецОбласти
